import { Rule } from 'types';
import { getRandomId } from 'utils/utils';

export function useRules(): {
  rules: Rule[];
} {
  const rules = [
    {
      id: getRandomId(),
      title: 'Алкогольна продукція',
      text: 'Етиловий спирт, пиво, лікеро-горілчана продукція',
    },
    {
      id: getRandomId(),
      title: 'Тютюнові вироби',
      text: 'Всі види тютюнових виробів та суміші для куріння',
    },
    {
      id: getRandomId(),
      title: 'Небезпечні речовини',
      text: 'Отруйні, радіоактивні, озоно-руйнівні речовини',
    },
    {
      id: getRandomId(),
      title: 'Культурні цінності',
      text: 'Культурні цінності, предмети старовини старше 50 років, антикваріат, карикатури, друковані репродукції',
    },
    {
      id: getRandomId(),
      title: 'Продукти',
      text: 'Кисломолочні, сирокопчені, заморожені, хлібобулочні вироби (продукти харчування можна ввозити/вивозити тільки в вакуумній або заводській упаковці)',
    },
    {
      id: getRandomId(),
      title: 'Документи',
      text: 'Кредитні, дебетові та подарункові карти, паспорти, посвідчення особи, трудові книжки, архіви, кореспонденція та листи',
    },
    {
      id: getRandomId(),
      title: 'Рослини',
      text: 'Рослини в любому вигляді та стані, насіння рослин',
    },
    {
      id: getRandomId(),
      title: 'Тварини',
      text: 'Живих тварин і їх частини (шкури тварин, хутро), риба і морепродукти',
    },
    {
      id: getRandomId(),
      title: 'Біологічні препарати',
      text: 'Вітаміни, лікарські препарати, біологічно-активні добавки та інші види препаратів',
    },
    {
      id: getRandomId(),
      title: 'Валюта і цінні папери',
      text: 'Грошові знаки, монети, валютні та інші цінності. Цінні папери, облігації і чеки всіх видів',
    },
    {
      id: getRandomId(),
      title: 'Дорогоцінні метали',
      text: 'Виняток: вироби зі сталі, пластмаси, гуми і скла',
    },
    {
      id: getRandomId(),
      title: 'Вибухонебезпечні речовини',
      text: 'Вибухонебезпечні та легкозаймисті речовини',
    },
    {
      id: getRandomId(),
      title: 'Зброя і її частини',
      text: 'Зброя будь-якого виду, арбалети і його частини, патрони, стріли (наконечники) до них і їх частини, вироби, конструктивно схожі з цивільною і службовою зброєю',
    },
    {
      id: getRandomId(),
      title: 'Товари, які швидко псуються',
      text: 'Свіжі фрутки і овочі, живі рослини, сирні продукти тваринного походження, кавбасні, молочні і рибні продукти',
    },
    {
      id: getRandomId(),
      title: 'Тактичне спорядження',
      text: 'Військове спорядження, електрошокери, приціли, окуляри нічного бачення, камуфляжна форма',
    },
    {
      id: getRandomId(),
      title: 'Наркотичні засоби',
      text: 'Наркотичні засоби, психотропні речовини',
    },
  ];

  return { rules };
}
